tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
# tap "blendle/blendle"
# tap "jabley/wrk2"
# tap "wmaciejak/seabolt"
# brew "adr-tools"

brew "coreutils" # Install GNU core utilities (those that come with macOS are outdated).
brew "moreutils" # Install some other useful utilities like `sponge`.
brew "findutils" # Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew "gnu-sed"   # Install GNU `sed`, overwriting the built-in `sed`.
brew "automake"
brew "cmake"
brew "make"
brew "gcc"
brew "ffmpeg"
# brew "jpeg"
# brew "optipng"
# brew "graphicsmagick"
brew "pkg-config"
brew "openjdk"
brew "gnupg" # Install GnuPG to enable PGP-signing commits.
# Install more recent versions of some macOS tools.
brew "curl" # Install more recent versions of some macOS tools.
# brew "gmp"
brew "grep"
brew "openssh"
brew "fswatch"
# brew "screen"

### SHELL 
# Install a modern version of Bash.
brew "bash"
brew "bash-completion"
brew "tmux"
# brew "tmuxinator"
brew "asdf" # All in one version manager
brew "bat"
brew "fzf"
brew "exa"
brew "thefuck"
cask "iterm2"
# brew "the_silver_searcher"

### EDITOR
brew "neovim"
# brew "macvim" --override-system-vim
# brew "vim" --with-override-system-vi

### Development
brew "asciidoc"
brew "git"
brew "tig"
brew "git-extras"
# brew git-lfs
cask "sublime-merge"
brew "pre-commit"
brew "podman"
brew "podman-compose"
cask "mongodb-compass"
cask "mockoon"
brew "minikube"
brew "yadm"
brew "helm"

### RUST
# Mold modern linker
# See: https://github.com/rui314/mold
brew "mold"

### UTILITIES
brew "asciiquarium"
brew "wget" #--with-iri # Install `wget` with IRI support.
brew "apktool"
brew "jadx"
brew "jq"
brew "yq"
brew "fpp"
brew "fd"
cask "burp-suite"
brew "tree"
brew "unzip"
brew "zip"
brew "ack"
brew "khal"
# brew "exiv2"
# brew "gs"
# brew "gvm"
brew "imagemagick" #--with-webp
# brew "lua"
# brew "lynx"
# brew "meld"
# brew "p7zip"
# brew "pigz"
# brew "pv"
# brew "pyenv"
# brew "python3"
# brew "python3-pip"
# brew "rename"
# brew "ripgrep"
# brew "rlwrap"
# brew "ssh-copy-id"

# brew "vbindiff"
# brew "zopfli"


### Install some CTF tools; see https://github.com/ctfs/write-ups.
# brew "aircrack-ng"
# brew "bfg"
# brew "binutils"
# brew "binwalk"
# brew "cifer"
# brew "dex2jar"
# brew "dns2tcp"
brew "dnsutils"
# brew "fcrackzip"
# brew "foremost"
# brew "hashpump"
# brew "hydra"
# brew "john"
# brew "knock"
# brew "netpbm"
brew "nmap"
brew "openvpn"
# brew "pngcheck"
# brew "socat"
# brew "sqlmap"
brew "tcpflow"
# brew "tcpreplay"
brew "tcptrace"
brew "traceroute"
# brew "ucspi-tcp" # `tcpserver` etc.
brew "whois"
# brew "xpdf"
# brew "xz"

# brew "gnutls"
# brew "openjpeg"
# brew "leptonica"
# brew "libarchive"
# brew "libass"
# brew "pango"
# brew "tesseract"
# brew "ffmpeg"
# brew "gcc"
# brew "gd"
# brew "gdk-pixbuf"
# brew "qt@5"
# brew "gnuplot"
# brew "golangci-lint"
# brew "grafana"
# brew "grafana-agent"
# brew "netpbm"
# brew "graphviz"
# brew "grpcurl"
# brew "guile"
# brew "kubectx"
# brew "kustomize"
# brew "libmagic"
# brew "librdkafka"
# brew "python@3.11"
# brew "mercurial"
# brew "protobuf"
# brew "mitmproxy"
# brew "node-build"
# brew "nodenv"
# brew "openblas"
# brew "numpy"
# brew "qemu"
# brew "virtualenv"
# brew "py3cairo"
# brew "pyenv"
# brew "python@3.10"
# brew "scipy"
# brew "siege"
# brew "spotify-tui"
# brew "wrk"
# cask "meld"
cask "font-hack-nerd-font"
