tap "jesseduffield/lazygit"

### Commons
brew "coreutils" # Install GNU core utilities (those that come with macOS are outdated).
brew "findutils" # Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew "moreutils" # Install some other useful utilities like `sponge`.
brew "gnu-sed"   # Install GNU `sed`, overwriting the built-in `sed`.
brew "gnupg" # Install GnuPG to enable PGP-signing commits.
brew "automake"
brew "cmake"
brew "gcc"
brew "make"

# Install more recent versions of some macOS tools.
brew "curl"
brew "fswatch"
brew "grep"
brew "openssh"
brew "pwgen"
brew "telnet"
brew "watch"
brew "wget" #--with-iri # Install `wget` with IRI support.

### SHELL
brew "bat"
brew "fd"
brew "fzf"
brew "hey"
brew "neovim"
brew "thefuck"
brew "tmux"
cask "font-hack-nerd-font"
cask "iterm2"

### Media
brew "ffmpeg"
# brew "graphicsmagick"
brew "graphviz"
# brew "jpeg-xl"
# brew "jpeg"
# brew "openjpeg"
# brew "optipng"
brew "webp"

### Development
brew "lima"
# brew "nodenv"
brew "openjdk"
brew "podman-compose"
brew "podman"
brew "pre-commit"
cask "visual-studio-code"
brew "wrk"

### GIT
brew "git"
brew "commitizen"
brew "git-cliff"
brew "git-interactive-rebase-tool"
brew "jesseduffield/lazygit/lazygit"

### K8s
brew "helm"
brew "helmfile"
brew "k9s"
brew "kubectx"
brew "kustomize"

### RUST
# Mold modern linker
# See: https://github.com/rui314/mold
brew "mold"

### UTILITIES
brew "btop"
brew "htop"
brew "jq"
brew "jsonnet-bundler"
brew "jsonnet"
brew "luarocks"
brew "ripgrep"
brew "totp-cli"
brew "tree"
brew "yq"

### Install some CTF tools; see https://github.com/ctfs/write-ups.
# brew "aircrack-ng"
# brew "bfg"
# brew "binutils"
# brew "binwalk"
# brew "cifer"
# brew "dex2jar"
# brew "dns2tcp"
brew "bind"
# brew "fcrackzip"
# brew "foremost"
# brew "hashpump"
# brew "hydra"
# brew "john"
# brew "knock"
# brew "netpbm"
brew "nmap"
# brew "openvpn"
# brew "pngcheck"
# brew "socat"
# brew "sqlmap"
brew "tcpflow"
# brew "tcpreplay"
brew "tcptrace"
# brew "ucspi-tcp" # `tcpserver` etc.
brew "whois"
# brew "xpdf"
# brew "xz"
cask "wireshark"
cask "burp-suite"

### VSCode
vscode "bierner.markdown-preview-github-styles"
vscode "eamodio.gitlens"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "docker.docker"
vscode "fabiospampinato.vscode-diff"
vscode "fabiospampinato.vscode-git-history"
vscode "felipecaputo.vscode-go-gvm"
vscode "foxundermoon.shell-format"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "grafana.vscode-jsonnet"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "janisdd.vscode-edit-csv"
vscode "jinliming2.vscode-go-template"
vscode "mechatroner.rainbow-csv"
vscode "moshfeu.compare-folders"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.vscode-typescript-next"
vscode "redhat.ansible"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "tim-koehler.helm-intellisense"
vscode "wholroyd.jinja"
vscode "xyz.local-history"
vscode "yinfei.luahelper"
